-- phpMyAdmin SQL Dump
-- version 4.8.4
-- https://www.phpmyadmin.net/
--
-- 主機: 127.0.0.1
-- 產生時間： 2019 年 03 月 20 日 02:55
-- 伺服器版本: 10.1.37-MariaDB
-- PHP 版本： 7.1.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `movie`
--

-- --------------------------------------------------------

--
-- 資料表結構 `film_primary_table`
--

CREATE TABLE `film_primary_table` (
  `sid` int(11) NOT NULL,
  `name_tw` varchar(255) NOT NULL,
  `name_en` varchar(255) NOT NULL,
  `intro_tw` varchar(1500) NOT NULL,
  `intro_en` varchar(1500) NOT NULL,
  `movie_pic` varchar(255) NOT NULL,
  `movie_genre` varchar(255) NOT NULL,
  `movie_ver` varchar(255) NOT NULL,
  `movie_rating` varchar(255) NOT NULL,
  `trailer` varchar(255) NOT NULL,
  `pirce` int(11) NOT NULL,
  `schedule` varchar(255) NOT NULL,
  `in_theaters` date NOT NULL,
  `out_theaters` date NOT NULL,
  `runtime` int(11) NOT NULL,
  `director_tw` varchar(255) NOT NULL,
  `director_en` varchar(255) NOT NULL,
  `country` varchar(255) NOT NULL,
  `subtitle` varchar(255) NOT NULL,
  `subtitle_lang` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='影片相關';

--
-- 資料表的匯出資料 `film_primary_table`
--

INSERT INTO `film_primary_table` (`sid`, `name_tw`, `name_en`, `intro_tw`, `intro_en`, `movie_pic`, `movie_genre`, `movie_ver`, `movie_rating`, `trailer`, `pirce`, `schedule`, `in_theaters`, `out_theaters`, `runtime`, `director_tw`, `director_en`, `country`, `subtitle`, `subtitle_lang`) VALUES
(1, 'Fate/stay night：II.迷途之蝶 Fate/stay night', '', '延續第一章預示之花劇情，聖杯戰爭進入中盤，隨著間桐家的當家間桐臓硯正式參戰，不只情勢更詭譎，戰況亦持續激化。士郎失去了Saber後，能否順利保護小櫻，守護兩人之間的約定？', 'The story focuses on the Holy Grail War and explores the relationship between Shirou Emiya and Sakura Matou, two teenagers participating in this conflict. The story continues immediately from Fate/stay night: Heaven\'s Feel I. presage flower, following Shirou as he continues to participate in the Holy Grail War even after being eliminated as a master.', '', '', '', '輔導級', '', 0, '', '2019-03-15', '0000-00-00', 118, '須藤友德', 'Tomonori Sudo', 'Japan', '有', '中'),
(3, '好看電影112313213213', 'Good Moive 1', '反正就是超好看的拉1', 'is good to see ? 1', 'nopic.jpg', '科幻片 1', '4DX', '普遍級', '預告片 1', 1, '元宵節 1', '2019-03-19', '2019-06-06', 1, '王 1', 'Wang 1', '台灣 1', '是', '中文 1'),
(4, '好看電影2', 'Good Moive 2', '反正就是超好看的拉2', 'is good to see ? 2', 'aaaa2.jpg', '科幻片 2', '4DX', '限制級 2', '預告片 2', 2, '元宵節 2', '2019-03-19', '2019-06-06', 2, '王 2', 'Wang 2', '台灣 2', '有 2', '中文 2'),
(5, '好看電影3', 'Good Moive 3', '反正就是超好看的拉3', 'is good to see ? 3', 'aaaa3.jpg', '科幻片 3', '4DX', '限制級 3', '預告片 3', 3, '元宵節 3', '2019-03-19', '2019-06-06', 3, '王 3', 'Wang 3', '台灣 3', '有 3', '中文 3'),
(6, '好看電影4', 'Good Moive 4', '反正就是超好看的拉4', 'is good to see ? 4', 'aaaa4.jpg', '科幻片 4', '4DX', '限制級 4', '預告片 4', 4, '元宵節 4', '2019-03-19', '2019-06-06', 4, '王 4', 'Wang 4', '台灣 4', '有 4', '中文 4'),
(7, '好看電影5', 'Good Moive 5', '反正就是超好看的拉5', 'is good to see ? 5', 'aaaa5.jpg', '科幻片 5', '4DX', '限制級 5', '預告片 5', 5, '元宵節 5', '2019-03-19', '2019-06-06', 5, '王 5', 'Wang 5', '台灣 5', '有 5', '中文 5'),
(9, '好看電影7', 'Good Moive 7', '反正就是超好看的拉7', 'is good to see ? 7', 'aaaa7.jpg', '科幻片 7', '4DX', '限制級 7', '預告片 7', 7, '元宵節 7', '2019-03-19', '2019-06-06', 7, '王 7', 'Wang 7', '台灣 7', '有 7', '中文 7'),
(11, '好看電影9', 'Good Moive 9', '反正就是超好看的拉9', 'is good to see ? 9', 'aaaa9.jpg', '科幻片 9', '4DX', '限制級 9', '預告片 9', 9, '元宵節 9', '2019-03-19', '2019-06-06', 9, '王 9', 'Wang 9', '台灣 9', '有 9', '中文 9'),
(12, '好看電影10', 'Good Moive 10', '反正就是超好看的拉10', 'is good to see ? 10', 'aaaa10.jpg', '科幻片 10', '4DX', '限制級 10', '預告片 10', 10, '元宵節 10', '2019-03-19', '2019-06-06', 10, '王 10', 'Wang 10', '台灣 10', '有 10', '中文 10'),
(13, '好看電影11', 'Good Moive 11', '反正就是超好看的拉11', 'is good to see ? 11', 'nopic.jpg', '科幻片 11', '4DX', '普遍級', '預告片 11', 11, '元宵節 11', '2019-03-19', '2019-06-06', 11, '王 11', 'Wang 11', '台灣 11', '是', '中文 11'),
(14, '好看電影12', 'Good Moive 12', '反正就是超好看的拉12', 'is good to see ? 12', 'aaaa12.jpg', '科幻片 12', '4DX', '限制級 12', '預告片 12', 12, '元宵節 12', '2019-03-19', '2019-06-06', 12, '王 12', 'Wang 12', '台灣 12', '有 12', '中文 12'),
(15, '好看電影13', 'Good Moive 13', '反正就是超好看的拉13', 'is good to see ? 13', 'aaaa13.jpg', '科幻片 13', '4DX', '限制級 13', '預告片 13', 13, '元宵節 13', '2019-03-19', '2019-06-06', 13, '王 13', 'Wang 13', '台灣 13', '有 13', '中文 13'),
(16, '好看電影14', 'Good Moive 14', '反正就是超好看的拉14', 'is good to see ? 14', 'aaaa14.jpg', '科幻片 14', '4DX', '限制級 14', '預告片 14', 14, '元宵節 14', '2019-03-19', '2019-06-06', 14, '王 14', 'Wang 14', '台灣 14', '有 14', '中文 14'),
(17, '好看電影15', 'Good Moive 15', '反正就是超好看的拉15', 'is good to see ? 15', 'aaaa15.jpg', '科幻片 15', '4DX', '限制級 15', '預告片 15', 15, '元宵節 15', '2019-03-19', '2019-06-06', 15, '王 15', 'Wang 15', '台灣 15', '有 15', '中文 15'),
(18, '好看電影16', 'Good Moive 16', '反正就是超好看的拉16', 'is good to see ? 16', 'aaaa16.jpg', '科幻片 16', '4DX', '限制級 16', '預告片 16', 16, '元宵節 16', '2019-03-19', '2019-06-06', 16, '王 16', 'Wang 16', '台灣 16', '有 16', '中文 16'),
(19, '好看電影17', 'Good Moive 17', '反正就是超好看的拉17', 'is good to see ? 17', 'aaaa17.jpg', '科幻片 17', '4DX', '限制級 17', '預告片 17', 17, '元宵節 17', '2019-03-19', '2019-06-06', 17, '王 17', 'Wang 17', '台灣 17', '有 17', '中文 17'),
(20, '好看電影18', 'Good Moive 18', '反正就是超好看的拉18', 'is good to see ? 18', 'aaaa18.jpg', '科幻片 18', '4DX', '限制級 18', '預告片 18', 18, '元宵節 18', '2019-03-19', '2019-06-06', 18, '王 18', 'Wang 18', '台灣 18', '有 18', '中文 18'),
(21, '好看電影19', 'Good Moive 19', '反正就是超好看的拉19', 'is good to see ? 19', 'aaaa19.jpg', '科幻片 19', '4DX', '限制級 19', '預告片 19', 19, '元宵節 19', '2019-03-19', '2019-06-06', 19, '王 19', 'Wang 19', '台灣 19', '有 19', '中文 19'),
(22, '好看電影20', 'Good Moive 20', '反正就是超好看的拉20', 'is good to see ? 20', 'aaaa20.jpg', '科幻片 20', '4DX', '限制級 20', '預告片 20', 20, '元宵節 20', '2019-03-19', '2019-06-06', 20, '王 20', 'Wang 20', '台灣 20', '有 20', '中文 20'),
(23, '好看電影21', 'Good Moive 21', '反正就是超好看的拉21', 'is good to see ? 21', 'aaaa21.jpg', '科幻片 21', '4DX', '限制級 21', '預告片 21', 21, '元宵節 21', '2019-03-19', '2019-06-06', 21, '王 21', 'Wang 21', '台灣 21', '有 21', '中文 21'),
(24, '好看電影22', 'Good Moive 22', '反正就是超好看的拉22', 'is good to see ? 22', 'aaaa22.jpg', '科幻片 22', '4DX', '限制級 22', '預告片 22', 22, '元宵節 22', '2019-03-19', '2019-06-06', 22, '王 22', 'Wang 22', '台灣 22', '有 22', '中文 22'),
(25, '好看電影23', 'Good Moive 23', '反正就是超好看的拉23', 'is good to see ? 23', 'aaaa23.jpg', '科幻片 23', '4DX', '限制級 23', '預告片 23', 23, '元宵節 23', '2019-03-19', '2019-06-06', 23, '王 23', 'Wang 23', '台灣 23', '有 23', '中文 23'),
(26, '好看電影24', 'Good Moive 24', '反正就是超好看的拉24', 'is good to see ? 24', 'aaaa24.jpg', '科幻片 24', '4DX', '限制級 24', '預告片 24', 24, '元宵節 24', '2019-03-19', '2019-06-06', 24, '王 24', 'Wang 24', '台灣 24', '有 24', '中文 24'),
(27, '好看電影25', 'Good Moive 25', '反正就是超好看的拉25', 'is good to see ? 25', 'aaaa25.jpg', '科幻片 25', '4DX', '限制級 25', '預告片 25', 25, '元宵節 25', '2019-03-19', '2019-06-06', 25, '王 25', 'Wang 25', '台灣 25', '有 25', '中文 25'),
(28, '好看電影26', 'Good Moive 26', '反正就是超好看的拉26', 'is good to see ? 26', 'aaaa26.jpg', '科幻片 26', '4DX', '限制級 26', '預告片 26', 26, '元宵節 26', '2019-03-19', '2019-06-06', 26, '王 26', 'Wang 26', '台灣 26', '有 26', '中文 26'),
(29, '好看電影27', 'Good Moive 27', '反正就是超好看的拉27', 'is good to see ? 27', 'aaaa27.jpg', '科幻片 27', '4DX', '限制級 27', '預告片 27', 27, '元宵節 27', '2019-03-19', '2019-06-06', 27, '王 27', 'Wang 27', '台灣 27', '有 27', '中文 27'),
(30, '好看電影28', 'Good Moive 28', '反正就是超好看的拉28', 'is good to see ? 28', 'aaaa28.jpg', '科幻片 28', '4DX', '限制級 28', '預告片 28', 28, '元宵節 28', '2019-03-19', '2019-06-06', 28, '王 28', 'Wang 28', '台灣 28', '有 28', '中文 28'),
(31, '好看電影29', 'Good Moive 29', '反正就是超好看的拉29', 'is good to see ? 29', 'aaaa29.jpg', '科幻片 29', '4DX', '限制級 29', '預告片 29', 29, '元宵節 29', '2019-03-19', '2019-06-06', 29, '王 29', 'Wang 29', '台灣 29', '有 29', '中文 29'),
(32, '好看電影30', 'Good Moive 30', '反正就是超好看的拉30', 'is good to see ? 30', 'aaaa30.jpg', '科幻片 30', '4DX', '限制級 30', '預告片 30', 30, '元宵節 30', '2019-03-19', '2019-06-06', 30, '王 30', 'Wang 30', '台灣 30', '有 30', '中文 30'),
(33, '好看電影31', 'Good Moive 31', '反正就是超好看的拉31', 'is good to see ? 31', 'aaaa31.jpg', '科幻片 31', '4DX', '限制級 31', '預告片 31', 31, '元宵節 31', '2019-03-19', '2019-06-06', 31, '王 31', 'Wang 31', '台灣 31', '有 31', '中文 31'),
(34, '好看電影32', 'Good Moive 32', '反正就是超好看的拉32', 'is good to see ? 32', 'aaaa32.jpg', '科幻片 32', '4DX', '限制級 32', '預告片 32', 32, '元宵節 32', '2019-03-19', '2019-06-06', 32, '王 32', 'Wang 32', '台灣 32', '有 32', '中文 32'),
(35, '好看電影33', 'Good Moive 33', '反正就是超好看的拉33', 'is good to see ? 33', 'aaaa33.jpg', '科幻片 33', '4DX', '限制級 33', '預告片 33', 33, '元宵節 33', '2019-03-19', '2019-06-06', 33, '王 33', 'Wang 33', '台灣 33', '有 33', '中文 33'),
(36, '好看電影34', 'Good Moive 34', '反正就是超好看的拉34', 'is good to see ? 34', 'aaaa34.jpg', '科幻片 34', '4DX', '限制級 34', '預告片 34', 34, '元宵節 34', '2019-03-19', '2019-06-06', 34, '王 34', 'Wang 34', '台灣 34', '有 34', '中文 34'),
(37, '好看電影35', 'Good Moive 35', '反正就是超好看的拉35', 'is good to see ? 35', 'aaaa35.jpg', '科幻片 35', '4DX', '限制級 35', '預告片 35', 35, '元宵節 35', '2019-03-19', '2019-06-06', 35, '王 35', 'Wang 35', '台灣 35', '有 35', '中文 35'),
(38, '好看電影36', 'Good Moive 36', '反正就是超好看的拉36', 'is good to see ? 36', 'aaaa36.jpg', '科幻片 36', '4DX', '限制級 36', '預告片 36', 36, '元宵節 36', '2019-03-19', '2019-06-06', 36, '王 36', 'Wang 36', '台灣 36', '有 36', '中文 36'),
(39, '好看電影37', 'Good Moive 37', '反正就是超好看的拉37', 'is good to see ? 37', 'aaaa37.jpg', '科幻片 37', '4DX', '限制級 37', '預告片 37', 37, '元宵節 37', '2019-03-19', '2019-06-06', 37, '王 37', 'Wang 37', '台灣 37', '有 37', '中文 37'),
(40, '好看電影38', 'Good Moive 38', '反正就是超好看的拉38', 'is good to see ? 38', 'aaaa38.jpg', '科幻片 38', '4DX', '限制級 38', '預告片 38', 38, '元宵節 38', '2019-03-19', '2019-06-06', 38, '王 38', 'Wang 38', '台灣 38', '有 38', '中文 38'),
(41, '好看電影39', 'Good Moive 39', '反正就是超好看的拉39', 'is good to see ? 39', 'aaaa39.jpg', '科幻片 39', '4DX', '限制級 39', '預告片 39', 39, '元宵節 39', '2019-03-19', '2019-06-06', 39, '王 39', 'Wang 39', '台灣 39', '有 39', '中文 39'),
(42, '好看電影40', 'Good Moive 40', '反正就是超好看的拉40', 'is good to see ? 40', 'aaaa40.jpg', '科幻片 40', '4DX', '限制級 40', '預告片 40', 40, '元宵節 40', '2019-03-19', '2019-06-06', 40, '王 40', 'Wang 40', '台灣 40', '有 40', '中文 40'),
(43, '好看電影41', 'Good Moive 41', '反正就是超好看的拉41', 'is good to see ? 41', 'aaaa41.jpg', '科幻片 41', '4DX', '限制級 41', '預告片 41', 41, '元宵節 41', '2019-03-19', '2019-06-06', 41, '王 41', 'Wang 41', '台灣 41', '有 41', '中文 41'),
(44, '好看電影42', 'Good Moive 42', '反正就是超好看的拉42', 'is good to see ? 42', 'aaaa42.jpg', '科幻片 42', '4DX', '限制級 42', '預告片 42', 42, '元宵節 42', '2019-03-19', '2019-06-06', 42, '王 42', 'Wang 42', '台灣 42', '有 42', '中文 42'),
(45, '好看電影43', 'Good Moive 43', '反正就是超好看的拉43', 'is good to see ? 43', 'aaaa43.jpg', '科幻片 43', '4DX', '限制級 43', '預告片 43', 43, '元宵節 43', '2019-03-19', '2019-06-06', 43, '王 43', 'Wang 43', '台灣 43', '有 43', '中文 43'),
(46, '好看電影44', 'Good Moive 44', '反正就是超好看的拉44', 'is good to see ? 44', 'aaaa44.jpg', '科幻片 44', '4DX', '限制級 44', '預告片 44', 44, '元宵節 44', '2019-03-19', '2019-06-06', 44, '王 44', 'Wang 44', '台灣 44', '有 44', '中文 44'),
(47, '好看電影45', 'Good Moive 45', '反正就是超好看的拉45', 'is good to see ? 45', 'aaaa45.jpg', '科幻片 45', '4DX', '限制級 45', '預告片 45', 45, '元宵節 45', '2019-03-19', '2019-06-06', 45, '王 45', 'Wang 45', '台灣 45', '有 45', '中文 45'),
(48, '好看電影46', 'Good Moive 46', '反正就是超好看的拉46', 'is good to see ? 46', 'aaaa46.jpg', '科幻片 46', '4DX', '限制級 46', '預告片 46', 46, '元宵節 46', '2019-03-19', '2019-06-06', 46, '王 46', 'Wang 46', '台灣 46', '有 46', '中文 46'),
(49, '好看電影47', 'Good Moive 47', '反正就是超好看的拉47', 'is good to see ? 47', 'aaaa47.jpg', '科幻片 47', '4DX', '限制級 47', '預告片 47', 47, '元宵節 47', '2019-03-19', '2019-06-06', 47, '王 47', 'Wang 47', '台灣 47', '有 47', '中文 47'),
(50, '好看電影48', 'Good Moive 48', '反正就是超好看的拉48', 'is good to see ? 48', 'aaaa48.jpg', '科幻片 48', '4DX', '限制級 48', '預告片 48', 48, '元宵節 48', '2019-03-19', '2019-06-06', 48, '王 48', 'Wang 48', '台灣 48', '有 48', '中文 48'),
(51, '好看電影49', 'Good Moive 49', '反正就是超好看的拉49', 'is good to see ? 49', 'aaaa49.jpg', '科幻片 49', '4DX', '限制級 49', '預告片 49', 49, '元宵節 49', '2019-03-19', '2019-06-06', 49, '王 49', 'Wang 49', '台灣 49', '有 49', '中文 49'),
(52, '好看電影50', 'Good Moive 50', '反正就是超好看的拉50', 'is good to see ? 50', 'aaaa50.jpg', '科幻片 50', '4DX', '限制級 50', '預告片 50', 50, '元宵節 50', '2019-03-19', '2019-06-06', 50, '王 50', 'Wang 50', '台灣 50', '有 50', '中文 50'),
(53, '好看電影51', 'Good Moive 51', '反正就是超好看的拉51', 'is good to see ? 51', 'aaaa51.jpg', '科幻片 51', '4DX', '限制級 51', '預告片 51', 51, '元宵節 51', '2019-03-19', '2019-06-06', 51, '王 51', 'Wang 51', '台灣 51', '有 51', '中文 51'),
(54, '好看電影52', 'Good Moive 52', '反正就是超好看的拉52', 'is good to see ? 52', 'aaaa52.jpg', '科幻片 52', '4DX', '限制級 52', '預告片 52', 52, '元宵節 52', '2019-03-19', '2019-06-06', 52, '王 52', 'Wang 52', '台灣 52', '有 52', '中文 52'),
(55, '好看電影53', 'Good Moive 53', '反正就是超好看的拉53', 'is good to see ? 53', 'aaaa53.jpg', '科幻片 53', '4DX', '限制級 53', '預告片 53', 53, '元宵節 53', '2019-03-19', '2019-06-06', 53, '王 53', 'Wang 53', '台灣 53', '有 53', '中文 53'),
(56, '好看電影54', 'Good Moive 54', '反正就是超好看的拉54', 'is good to see ? 54', 'aaaa54.jpg', '科幻片 54', '4DX', '限制級 54', '預告片 54', 54, '元宵節 54', '2019-03-19', '2019-06-06', 54, '王 54', 'Wang 54', '台灣 54', '有 54', '中文 54'),
(57, '好看電影55', 'Good Moive 55', '反正就是超好看的拉55', 'is good to see ? 55', 'aaaa55.jpg', '科幻片 55', '4DX', '限制級 55', '預告片 55', 55, '元宵節 55', '2019-03-19', '2019-06-06', 55, '王 55', 'Wang 55', '台灣 55', '有 55', '中文 55'),
(58, '好看電影56', 'Good Moive 56', '反正就是超好看的拉56', 'is good to see ? 56', 'aaaa56.jpg', '科幻片 56', '4DX', '限制級 56', '預告片 56', 56, '元宵節 56', '2019-03-19', '2019-06-06', 56, '王 56', 'Wang 56', '台灣 56', '有 56', '中文 56'),
(59, '好看電影57', 'Good Moive 57', '反正就是超好看的拉57', 'is good to see ? 57', 'aaaa57.jpg', '科幻片 57', '4DX', '限制級 57', '預告片 57', 57, '元宵節 57', '2019-03-19', '2019-06-06', 57, '王 57', 'Wang 57', '台灣 57', '有 57', '中文 57'),
(60, '好看電影58', 'Good Moive 58', '反正就是超好看的拉58', 'is good to see ? 58', 'aaaa58.jpg', '科幻片 58', '4DX', '限制級 58', '預告片 58', 58, '元宵節 58', '2019-03-19', '2019-06-06', 58, '王 58', 'Wang 58', '台灣 58', '有 58', '中文 58'),
(61, '好看電影59', 'Good Moive 59', '反正就是超好看的拉59', 'is good to see ? 59', 'aaaa59.jpg', '科幻片 59', '4DX', '限制級 59', '預告片 59', 59, '元宵節 59', '2019-03-19', '2019-06-06', 59, '王 59', 'Wang 59', '台灣 59', '有 59', '中文 59'),
(62, '好看電影60', 'Good Moive 60', '反正就是超好看的拉60', 'is good to see ? 60', 'aaaa60.jpg', '科幻片 60', '4DX', '限制級 60', '預告片 60', 60, '元宵節 60', '2019-03-19', '2019-06-06', 60, '王 60', 'Wang 60', '台灣 60', '有 60', '中文 60'),
(63, '好看電影61', 'Good Moive 61', '反正就是超好看的拉61', 'is good to see ? 61', 'aaaa61.jpg', '科幻片 61', '4DX', '限制級 61', '預告片 61', 61, '元宵節 61', '2019-03-19', '2019-06-06', 61, '王 61', 'Wang 61', '台灣 61', '有 61', '中文 61'),
(64, '好看電影62', 'Good Moive 62', '反正就是超好看的拉62', 'is good to see ? 62', 'aaaa62.jpg', '科幻片 62', '4DX', '限制級 62', '預告片 62', 62, '元宵節 62', '2019-03-19', '2019-06-06', 62, '王 62', 'Wang 62', '台灣 62', '有 62', '中文 62'),
(65, '好看電影63', 'Good Moive 63', '反正就是超好看的拉63', 'is good to see ? 63', 'aaaa63.jpg', '科幻片 63', '4DX', '限制級 63', '預告片 63', 63, '元宵節 63', '2019-03-19', '2019-06-06', 63, '王 63', 'Wang 63', '台灣 63', '有 63', '中文 63'),
(66, '好看電影64', 'Good Moive 64', '反正就是超好看的拉64', 'is good to see ? 64', 'aaaa64.jpg', '科幻片 64', '4DX', '限制級 64', '預告片 64', 64, '元宵節 64', '2019-03-19', '2019-06-06', 64, '王 64', 'Wang 64', '台灣 64', '有 64', '中文 64'),
(67, '好看電影65', 'Good Moive 65', '反正就是超好看的拉65', 'is good to see ? 65', 'aaaa65.jpg', '科幻片 65', '4DX', '限制級 65', '預告片 65', 65, '元宵節 65', '2019-03-19', '2019-06-06', 65, '王 65', 'Wang 65', '台灣 65', '有 65', '中文 65'),
(68, '好看電影66', 'Good Moive 66', '反正就是超好看的拉66', 'is good to see ? 66', 'aaaa66.jpg', '科幻片 66', '4DX', '限制級 66', '預告片 66', 66, '元宵節 66', '2019-03-19', '2019-06-06', 66, '王 66', 'Wang 66', '台灣 66', '有 66', '中文 66'),
(69, '好看電影67', 'Good Moive 67', '反正就是超好看的拉67', 'is good to see ? 67', 'aaaa67.jpg', '科幻片 67', '4DX', '限制級 67', '預告片 67', 67, '元宵節 67', '2019-03-19', '2019-06-06', 67, '王 67', 'Wang 67', '台灣 67', '有 67', '中文 67'),
(70, '好看電影68', 'Good Moive 68', '反正就是超好看的拉68', 'is good to see ? 68', 'aaaa68.jpg', '科幻片 68', '4DX', '限制級 68', '預告片 68', 68, '元宵節 68', '2019-03-19', '2019-06-06', 68, '王 68', 'Wang 68', '台灣 68', '有 68', '中文 68'),
(71, '好看電影69', 'Good Moive 69', '反正就是超好看的拉69', 'is good to see ? 69', 'aaaa69.jpg', '科幻片 69', '4DX', '限制級 69', '預告片 69', 69, '元宵節 69', '2019-03-19', '2019-06-06', 69, '王 69', 'Wang 69', '台灣 69', '有 69', '中文 69'),
(72, '好看電影70', 'Good Moive 70', '反正就是超好看的拉70', 'is good to see ? 70', 'aaaa70.jpg', '科幻片 70', '4DX', '限制級 70', '預告片 70', 70, '元宵節 70', '2019-03-19', '2019-06-06', 70, '王 70', 'Wang 70', '台灣 70', '有 70', '中文 70'),
(73, '好看電影71', 'Good Moive 71', '反正就是超好看的拉71', 'is good to see ? 71', 'aaaa71.jpg', '科幻片 71', '4DX', '限制級 71', '預告片 71', 71, '元宵節 71', '2019-03-19', '2019-06-06', 71, '王 71', 'Wang 71', '台灣 71', '有 71', '中文 71'),
(74, '好看電影72', 'Good Moive 72', '反正就是超好看的拉72', 'is good to see ? 72', 'aaaa72.jpg', '科幻片 72', '4DX', '限制級 72', '預告片 72', 72, '元宵節 72', '2019-03-19', '2019-06-06', 72, '王 72', 'Wang 72', '台灣 72', '有 72', '中文 72'),
(75, '好看電影73', 'Good Moive 73', '反正就是超好看的拉73', 'is good to see ? 73', 'aaaa73.jpg', '科幻片 73', '4DX', '限制級 73', '預告片 73', 73, '元宵節 73', '2019-03-19', '2019-06-06', 73, '王 73', 'Wang 73', '台灣 73', '有 73', '中文 73'),
(76, '好看電影74', 'Good Moive 74', '反正就是超好看的拉74', 'is good to see ? 74', 'aaaa74.jpg', '科幻片 74', '4DX', '限制級 74', '預告片 74', 74, '元宵節 74', '2019-03-19', '2019-06-06', 74, '王 74', 'Wang 74', '台灣 74', '有 74', '中文 74'),
(77, '好看電影75', 'Good Moive 75', '反正就是超好看的拉75', 'is good to see ? 75', 'aaaa75.jpg', '科幻片 75', '4DX', '限制級 75', '預告片 75', 75, '元宵節 75', '2019-03-19', '2019-06-06', 75, '王 75', 'Wang 75', '台灣 75', '有 75', '中文 75'),
(78, '好看電影76', 'Good Moive 76', '反正就是超好看的拉76', 'is good to see ? 76', 'aaaa76.jpg', '科幻片 76', '4DX', '限制級 76', '預告片 76', 76, '元宵節 76', '2019-03-19', '2019-06-06', 76, '王 76', 'Wang 76', '台灣 76', '有 76', '中文 76'),
(79, '好看電影77', 'Good Moive 77', '反正就是超好看的拉77', 'is good to see ? 77', 'aaaa77.jpg', '科幻片 77', '4DX', '限制級 77', '預告片 77', 77, '元宵節 77', '2019-03-19', '2019-06-06', 77, '王 77', 'Wang 77', '台灣 77', '有 77', '中文 77'),
(80, '好看電影78', 'Good Moive 78', '反正就是超好看的拉78', 'is good to see ? 78', 'aaaa78.jpg', '科幻片 78', '4DX', '限制級 78', '預告片 78', 78, '元宵節 78', '2019-03-19', '2019-06-06', 78, '王 78', 'Wang 78', '台灣 78', '有 78', '中文 78'),
(81, '好看電影79', 'Good Moive 79', '反正就是超好看的拉79', 'is good to see ? 79', 'aaaa79.jpg', '科幻片 79', '4DX', '限制級 79', '預告片 79', 79, '元宵節 79', '2019-03-19', '2019-06-06', 79, '王 79', 'Wang 79', '台灣 79', '有 79', '中文 79'),
(82, '好看電影80', 'Good Moive 80', '反正就是超好看的拉80', 'is good to see ? 80', 'aaaa80.jpg', '科幻片 80', '4DX', '限制級 80', '預告片 80', 80, '元宵節 80', '2019-03-19', '2019-06-06', 80, '王 80', 'Wang 80', '台灣 80', '有 80', '中文 80'),
(83, '好看電影81', 'Good Moive 81', '反正就是超好看的拉81', 'is good to see ? 81', 'aaaa81.jpg', '科幻片 81', '4DX', '限制級 81', '預告片 81', 81, '元宵節 81', '2019-03-19', '2019-06-06', 81, '王 81', 'Wang 81', '台灣 81', '有 81', '中文 81'),
(84, '好看電影82', 'Good Moive 82', '反正就是超好看的拉82', 'is good to see ? 82', 'aaaa82.jpg', '科幻片 82', '4DX', '限制級 82', '預告片 82', 82, '元宵節 82', '2019-03-19', '2019-06-06', 82, '王 82', 'Wang 82', '台灣 82', '有 82', '中文 82'),
(85, '好看電影83', 'Good Moive 83', '反正就是超好看的拉83', 'is good to see ? 83', 'aaaa83.jpg', '科幻片 83', '4DX', '限制級 83', '預告片 83', 83, '元宵節 83', '2019-03-19', '2019-06-06', 83, '王 83', 'Wang 83', '台灣 83', '有 83', '中文 83'),
(86, '好看電影84', 'Good Moive 84', '反正就是超好看的拉84', 'is good to see ? 84', 'aaaa84.jpg', '科幻片 84', '4DX', '限制級 84', '預告片 84', 84, '元宵節 84', '2019-03-19', '2019-06-06', 84, '王 84', 'Wang 84', '台灣 84', '有 84', '中文 84'),
(87, '好看電影85', 'Good Moive 85', '反正就是超好看的拉85', 'is good to see ? 85', 'aaaa85.jpg', '科幻片 85', '4DX', '限制級 85', '預告片 85', 85, '元宵節 85', '2019-03-19', '2019-06-06', 85, '王 85', 'Wang 85', '台灣 85', '有 85', '中文 85'),
(88, '好看電影86', 'Good Moive 86', '反正就是超好看的拉86', 'is good to see ? 86', 'aaaa86.jpg', '科幻片 86', '4DX', '限制級 86', '預告片 86', 86, '元宵節 86', '2019-03-19', '2019-06-06', 86, '王 86', 'Wang 86', '台灣 86', '有 86', '中文 86'),
(89, '好看電影87', 'Good Moive 87', '反正就是超好看的拉87', 'is good to see ? 87', 'aaaa87.jpg', '科幻片 87', '4DX', '限制級 87', '預告片 87', 87, '元宵節 87', '2019-03-19', '2019-06-06', 87, '王 87', 'Wang 87', '台灣 87', '有 87', '中文 87'),
(90, '好看電影88', 'Good Moive 88', '反正就是超好看的拉88', 'is good to see ? 88', 'aaaa88.jpg', '科幻片 88', '4DX', '限制級 88', '預告片 88', 88, '元宵節 88', '2019-03-19', '2019-06-06', 88, '王 88', 'Wang 88', '台灣 88', '有 88', '中文 88'),
(91, '好看電影89', 'Good Moive 89', '反正就是超好看的拉89', 'is good to see ? 89', 'aaaa89.jpg', '科幻片 89', '4DX', '限制級 89', '預告片 89', 89, '元宵節 89', '2019-03-19', '2019-06-06', 89, '王 89', 'Wang 89', '台灣 89', '有 89', '中文 89'),
(92, '好看電影90', 'Good Moive 90', '反正就是超好看的拉90', 'is good to see ? 90', 'aaaa90.jpg', '科幻片 90', '4DX', '限制級 90', '預告片 90', 90, '元宵節 90', '2019-03-19', '2019-06-06', 90, '王 90', 'Wang 90', '台灣 90', '有 90', '中文 90'),
(93, '好看電影91', 'Good Moive 91', '反正就是超好看的拉91', 'is good to see ? 91', 'aaaa91.jpg', '科幻片 91', '4DX', '限制級 91', '預告片 91', 91, '元宵節 91', '2019-03-19', '2019-06-06', 91, '王 91', 'Wang 91', '台灣 91', '有 91', '中文 91'),
(94, '好看電影92', 'Good Moive 92', '反正就是超好看的拉92', 'is good to see ? 92', 'aaaa92.jpg', '科幻片 92', '4DX', '限制級 92', '預告片 92', 92, '元宵節 92', '2019-03-19', '2019-06-06', 92, '王 92', 'Wang 92', '台灣 92', '有 92', '中文 92'),
(95, '好看電影93', 'Good Moive 93', '反正就是超好看的拉93', 'is good to see ? 93', 'aaaa93.jpg', '科幻片 93', '4DX', '限制級 93', '預告片 93', 93, '元宵節 93', '2019-03-19', '2019-06-06', 93, '王 93', 'Wang 93', '台灣 93', '有 93', '中文 93'),
(96, '好看電影94', 'Good Moive 94', '反正就是超好看的拉94', 'is good to see ? 94', 'aaaa94.jpg', '科幻片 94', '4DX', '限制級 94', '預告片 94', 94, '元宵節 94', '2019-03-19', '2019-06-06', 94, '王 94', 'Wang 94', '台灣 94', '有 94', '中文 94'),
(97, '好看電影95', 'Good Moive 95', '反正就是超好看的拉95', 'is good to see ? 95', 'aaaa95.jpg', '科幻片 95', '4DX', '限制級 95', '預告片 95', 95, '元宵節 95', '2019-03-19', '2019-06-06', 95, '王 95', 'Wang 95', '台灣 95', '有 95', '中文 95'),
(98, '好看電影96', 'Good Moive 96', '反正就是超好看的拉96', 'is good to see ? 96', 'aaaa96.jpg', '科幻片 96', '4DX', '限制級 96', '預告片 96', 96, '元宵節 96', '2019-03-19', '2019-06-06', 96, '王 96', 'Wang 96', '台灣 96', '有 96', '中文 96'),
(100, '好看電影98', 'Good Moive 98', '反正就是超好看的拉98', 'is good to see ? 98', 'aaaa98.jpg', '科幻片 98', '4DX', '限制級 98', '預告片 98', 98, '元宵節 98', '2019-03-19', '2019-06-06', 98, '王 98', 'Wang 98', '台灣 98', '有 98', '中文 98'),
(102, 'test11111', 'test11111', '', '', '', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(103, 'test11111', 'test11111', '', '', '', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(104, 'test11111', 'test11111', '', '', '', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(105, '', '', '', '', '', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(106, '', '', '', '', '', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(107, 'test11111', 'test11111', 'test11111', 'test11111', '', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 123, '', '', '', '', ''),
(108, 'test11111', 'test11111', 'test11111', 'test11111', '', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 123, '', '', '', '', ''),
(109, '', '', '', '', '', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(110, '', '', '', '', '', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(111, '', '', '', '', '', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(112, 'test11111', '', '', '', '', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(113, 'test11111', 'test11111', 'test11111', 'test11111', '', 'test11111test11111', 'test11111', 'test11111', 'test11111', 123123123, '234234', '1990-03-03', '1990-03-03', 123, 'test11111', 'test11111', 'test11111', 'test11111', 'test11111'),
(114, 'test11111', 'test11111', 'test11111', 'test11111', '', 'test11111test11111', 'test11111', 'test11111', 'test11111', 123123123, '234234', '1990-03-03', '1990-03-03', 123, 'test11111', 'test11111', 'test11111', 'test11111', 'test11111'),
(115, 'test11111', 'qwe', 'qwe', 'qwe', '', 'qwe', 'qwe', 'qwe', 'qwe', 0, 'qwe', '0000-00-00', '0000-00-00', 0, 'qwe', 'qwe', 'qwe', 'qwe', 'qwe'),
(116, 'test11111', 'qwe', 'qwe', 'qwe', '', 'qwe', 'qwe', 'qwe', 'qwe', 0, 'qwe', '0000-00-00', '0000-00-00', 0, 'qwe', 'qwe', 'qwe', 'qwe', 'qwe'),
(117, '', '', '', '', '', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(118, '', '', '', '', '', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(119, '', '', '', '', '', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(120, '', '', '', '', '', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(121, '', '', '', '', '', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(122, '', '', '', '', '', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(123, '', '', '', '', '', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(124, '1', '2', '3', '4', '', '5', '6', '7', '8', 9, '10', '0000-00-00', '0000-00-00', 13, '14', '15', '16', '17', '18'),
(125, '', '', '', '', '', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(126, 'test222', 'test222', 'test222', 'test222', '', 'test222', 'test222', 'test222', 'test222', 0, 'test222', '1990-03-03', '1990-03-03', 321, 'test222', 'test222', 'test222', 'test222', 'test222'),
(127, 'test222', 'test222', 'test222', 'test222', '', 'test222', 'test222', 'test222', 'test222', 0, 'test222', '1990-03-03', '1990-03-03', 321, 'test222', 'test222', 'test222', 'test222', 'test222'),
(128, 'test222', 'test222', 'test222', 'test222', '', 'test222', 'test222', 'test222', 'test222', 0, 'test222', '1990-03-03', '1990-03-03', 321, 'test222', 'test222', 'test222', 'test222', 'test222'),
(129, 'test333', 'qwetest333', '', '', '', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(130, 'test444', 'test444', 'test444', 'test444', '', 'test444', 'test444', 'test444', 'test444', 444, 'test444', '1990-03-03', '1990-03-03', 321, 'test444', 'test444', 'test444', 'test444', 'test444'),
(131, 'test555', 'test555', 'test555', 'test555', '', 'test555', 'test555', 'test444test555', 'test555', 555, 'test555', '1990-03-03', '1990-03-03', 321, 'test555', 'test555', 'test444test555', 'test555', 'test555'),
(132, 'test666', 'test666', 'test666', 'test666', '1f8a68eb8b4c84f34ace4efbd7421bb685bc7883.png', 'test666', 'test666', 'test666', 'test666', 666, 'test666', '1990-03-03', '1990-03-03', 321, 'test666', 'test666', 'test666', 'test666', 'test666'),
(133, 'test666', 'test666', 'test666', 'test666', '412073c5592aa85790db3324a8d966c4a6103bee.png', 'test666', 'test666', 'test666', 'test666', 666, 'test666', '1990-03-03', '1990-03-03', 321, 'test666', 'test666', 'test666', 'test666', 'test666'),
(134, '', '', '', '', 'd6dd2de3eec0d36dda1de217b7c751e31179ab89.jpg', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(135, '', '', '', '', '9b020be38021b57c1ab14001b980bf7e5a062760.jpg', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(136, '', '', '', '', 'a7fd6c4d13e523c9650b3a7fc827a6f564ae3479.jpg', '', '', '選擇電影分級', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(137, '', '', '', '', '04b3cf57f3a420a5a3f949f81d90969e52384c46.jpg', '', '', '', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(138, '', '', '', '', 'f4f403b86bb955b960d93cfc13a7e6db7284655e.jpg', '', '', '普', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(139, '', '', '', '', 'nopic.jpg', '', '', '護', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(140, '', '', '', '', 'nopic.jpg', '', '4DX', '普遍級', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '', ''),
(141, '', '', '', '', 'nopic.jpg', '', '選擇放映類型', '選擇電影分級', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '否', ''),
(142, '好看電影11111', 'Good Moive 1', '反正就是超好看的拉1', 'is good to see ? 1', 'nopic.jpg', '科幻片 1', '4DX', '普遍級', '預告片 1', 1, '元宵節 1', '2019-03-19', '2019-06-06', 1, '王 1', 'Wang 1', '台灣 1', '是', '中文 1'),
(143, '', '', '', '', 'nopic.jpg', '', '4DX', '普遍級', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '是', ''),
(144, '好看電影11', 'Good Moive 11', '反正就是超好看的拉11', 'is good to see ? 11', 'nopic.jpg', '科幻片 11', '4DX', '普遍級', '預告片 11', 11, '元宵節 11', '2019-03-19', '2019-06-06', 11, '王 11', 'Wang 11', '台灣 11', '是', '中文 11'),
(145, 'ROY', 'ROY', 'ROY', 'ROY', 'f37f9e76ae15aa56bdc237b3a991ec91dd9fc078.png', 'ROY', '4DX', '普遍級', 'ROY', 0, 'ROY', '1990-03-03', '1990-03-03', 0, 'ROY', 'ROY', 'ROY', '是', 'ROY'),
(146, '', '', '', '', 'nopic.jpg', '', '4DX', '普遍級', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '是', ''),
(147, '', '', '', '', 'nopic.jpg', '', '4DX', '普遍級', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '是', ''),
(148, '', '', '', '', 'nopic.jpg', '', '4DX', '普遍級', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '是', ''),
(149, '', '', '', '', 'nopic.jpg', '', '4DX', '普遍級', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '是', ''),
(150, '', '', '', '', 'nopic.jpg', '', '4DX', '普遍級', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '是', ''),
(151, '', '', '', '', 'nopic.jpg', '', '4DX', '普遍級', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '是', ''),
(152, '', '', '', '', '10c40488e8d8d316a40b5cf5347447e5bf328dc0.png', '', '4DX', '普遍級', '', 0, '', '0000-00-00', '0000-00-00', 0, '', '', '', '是', '');

--
-- 已匯出資料表的索引
--

--
-- 資料表索引 `film_primary_table`
--
ALTER TABLE `film_primary_table`
  ADD PRIMARY KEY (`sid`);

--
-- 在匯出的資料表使用 AUTO_INCREMENT
--

--
-- 使用資料表 AUTO_INCREMENT `film_primary_table`
--
ALTER TABLE `film_primary_table`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=153;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
